//     tSF Briefing
// Do not modify this part
#define BRIEFING		_briefing = [];
#define TOPIC(NAME) 	_briefing pushBack ["Diary", [ NAME,
#define END			]];
#define ADD_TOPICS	for "_i" from (count _briefing) to 0 step -1 do {player createDiaryRecord (_briefing select _i);};
#define TAGS tSF_MissionTags = 
//
//
// Mission tags
TAGS(["COMB.ARMS","ARMOR","RolePlay"]);

// Briefing goes here

BRIEFING

TOPIC("0. Кампанія:")
"Після затяжної політичної кризи в Європейському Союзі та виходу з неї Греції наступними претендентами на вихід з організації стали країни Вишеградської Четвірки. У червні 2017-го року в Польщі відбулися позачергові президентські вибори, де з невеликим відривом переміг кандидат від радикальних євроскептиків, через місяць його проєвропейського опонента було вбито внаслідок теракту, що спровокувало масові заворушення і призвело до запровадження військового стану, під приводом запобігання ескалації конфлікту 17 вересня 2017-го року об'єднані сили ФРН, Великобританії, Франції, Нідерландів та Бель. з 19 по 24 жовтня Білорусь, Росія та Україна проводили мобілізацію і 26 жовтня оголосили про вступ до конфлікту на боці Польщі.
<br />На даний момент німецько-французькі сили розвивають наступ, просуваючись до Варшави. Після початку блокади Вроцлава наступним ключовим містом на півдні стає Катовіце і найближче до нього місто на заході - Крапковіце."
END

TOPIC("I. Обстановка:")
"В останні дні німецькі сили влаштовували численні атаки малими групами, намагаючись відтіснити нас від міста Крапковіце, щоб завершити оточення міста. Білоруське командування прийняло відступити з вразливих південно-західних позицій до містечка Лісниця, провести перегрупування і висунутися на північний захід, у той час на північний захід. як наш український контингент мав продовжити утримання цієї ділянки фронту.
<br />Невелика механізована група білорусів розпочала передислокацію з Мишкіно, проте потрапила в засідку роти німецьких десантників, які недавно перекинули на нашу ділянку фронту. Ситуацію посилила підтримка артилерії, внаслідок чого майже всю групу було знищено.
<br />Проте годину тому на зв'язок вийшов командир групи, гвардії капітан Березенко. Він вказав приблизне місце розташування сил противника, а також імовірні позиції німецьких ПТРК та коригувальників. У зв'язку з нововиявленими обставинами, командування доручило нам провести рятувальну операцію. Зважаючи на минулі заслуги капітана Березенка та важливе ідеологічне значення операції для зміцнення згуртованості коаліції, штаб надав нам прямий зв'язок з полковою батареєю БМ-21 ""Град""."
END

TOPIC("А. Ворожі сили:")
"У РБД знаходиться рота німецьких десантників з Fallschirmjägerbrigade №12. Бійці FJB-12 хоч і не мають важкої техніки і захисного спорядження, проте з лишком компенсують ці недоліки залізною дисципліною і надзвичайно високим рівнем бойової підготовки.
<br />Відомо про наявність у противника як мінімум двох ПТРК.
<br />За даними розвідки, із північно-західного напрямку Бундесвер підтягує механізовані сили. Передбачається прибуття танків Leopard 2A6 та елітних інженерно-штурмових груп Бундесверу, Bunkerjäger.
<br />Імовірно, в РБД знаходиться група FSLK200 або звичайних розвідників, яка коригує ворожу артилерію."
END

TOPIC("Б. Дружні сили:")
"Два відділення механізованої бригади ЗСУ """"Маршал Тимошенко"""" знаходиться в зоні евакуації.
<br />Т-72Б3 ЗС РБ гвардії капітана Березенка. Знаходиться в селищі Пулкове."
END

TOPIC("II. Завдання:")
"1. Необхідно доставити Березенка із селища Пулкове до зони евакуації.
<br />2. По можливості вивезти танк капітана Березенка.
<br />3. По можливості знайти b знищити групу коригувальників.
<br />"
END

TOPIC("III. Виконання:")
"Українським силам варто провести рятувальну операцію в максимально стислий термін. На момент початку ворог має перевагу в живій силі, але не в бойовій техніці, проте, у разі зволікання, нам протистоятимуть не тільки елітні десантники ФРН, а й не менш імениті бойові інженери та важкі танки.
<br />Рекомендується не розділяти піхотні сили та БМП.
<br />Рекомендується викликати підтримку РСЗВ при перших зіткненнях із ворогом для зменшення дружніх втрат та прискорення просування. А якщо ні, то доцільно залишити підтримку для ведення загороджувального вогню при відступі разом з капітаном Березенком.
<br />Капітану Березенко НАПОЛЕГЛИВО НЕ РЕКОМЕНДУЄТЬСЯ займати танк до з'єднання з силами ЗСУ, так само як і намагатися одноосібно прорватися з оточення в пішому порядку. Тим не менш, його місцезнаходження дозволяє йому вести обмежену розвідку пересування ворога і уточнити розташування сил противника."
END

TOPIC("IV. Підтримка")
"ЗСУ:
<br />БМП-2 зр. 86 x2
<br />FARP
<br />CCP
<br />Батарея БМ-21 ""Град"" з позивним ""Пасіка-6-1""
<br />
<br />НД РБ:
<br />Т-72Б3"
END

TOPIC("V. Сигнали:")
"PL NET 50 Mhz
<br />SUP NET 51 Mhz
<br />
<br />1'1 - SR CH 1
<br />1'2 - SR CH 2
<br />1'3 - SR CH 3"
END

TOPIC("VI. Зауваження:")
"Дружня техніка може ставити димову завісу на ходу, проте не варто надто розраховувати на цю опцію."
END

if ((serverCommandAvailable '#logout') || !(isMultiplayer) || isServer) then {
TOPIC("VII. Замечания для GSO:")
"### Информация которую увидит только ГСО. Указать какой тактики будет придерживаться враг, какие резервы он имеет и прочие советы по курированию миссии."
END
};

ADD_TOPICS