class WIN
    {
        title = "Завдання виконане";
        subtitle = "Успіх!";
        description = "Ми змогли врятувати капітана Березенка!";
    };
class TANKWIN
    {
        title = "Завдання виконане";
        subtitle = "Успіх!";
        description = "Ми змогли врятувати капітана Березенка та його танк!";
    };

class SPOTTERWIN
    {
        title = "Завдання виконане";
        subtitle = "Успіх!";
        description = "Ми змогли врятувати капітана Березенка та ліквідувати коригувальників!";
    };

class SPOTTERTANKWIN
    {
        title = "Завдання виконане";
        subtitle = "Успіх!";
        description = "Ми виконали всі поставлені завдання!";
    };

    class LOSE
    {
        title = "Завдання провалено";
        subtitle = "Поразка!";
        description = "Капітан Березенко загинув разом зі всією своєю групою!";
    };


    class WIPED
    {
        title = "Завдання провалено";
        subtitle = "Всі загинули!";
        description = "Бойова група розбита; ми не змогли забезпечити евакуацію капітана Березенка!"